RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Source/gd32f5xx_fmc.c
    REG32(reg_addr) = (uint32_t)ef_data;

    /* start array write EFUSE operation */
    EFUSE_CS |= EFUSE_CS_EFSTR;

    /* wait for the operation to complete */
    efuse_state = efuse_ready_wait(EFUSE_PGIF, EFUSE_TIMEOUT_COUNT);

    return efuse_state;
}

/*!
    \brief      write control data parameter
    \param[in]  ef_data: EFUSE data to write
    \param[out] none
    \retval     state of EFUSE:
      \arg        EFUSE_READY: EFUSE operation has been completed
      \arg        EFUSE_BUSY: EFUSE operation is in progress
      \arg        EFUSE_OBER: overstep boundary error
      \arg        EFUSE_TOERR: EFUSE timeout error
*/
efuse_state_enum efuse_control_write(uint8_t ef_data)
{
    return efuse_write(EFUSE_CTL_EFADDR, 1UL, ef_data);
}

/*!
    \brief      write user data parameter
    \param[in]  ef_data: EFUSE data to write
    \param[out] none
    \retval     state of EFUSE:
      \arg        EFUSE_READY: EFUSE operation has been completed
      \arg        EFUSE_BUSY: EFUSE operation is in progress
      \arg        EFUSE_OBER: overstep boundary error
      \arg        EFUSE_TOERR: EFUSE timeout error
*/
efuse_state_enum efuse_user_data_write(uint8_t ef_data)
{
    return efuse_write(USER_DATA_EFADDR, 1UL, ef_data);
}

/*!
    \brief      get EFUSE flag is set or not
    \param[in]  efuse_flag: specifies to get a flag
                only one parameter can be selected which is shown as below:
      \arg        EFUSE_PGIF: programming operation completion flag
      \arg        EFUSE_RDIF: read operation completion flag
      \arg        EFUSE_OBERIF: overstep boundary error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus efuse_flag_get(uint32_t efuse_flag)
{
    if(EFUSE_CS & efuse_flag) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear EFUSE pending flag
    \param[in]  flag: specifies to clear a flag
                only one parameter can be selected which is shown as below:
      \arg        EFUSE_PGIC: clear programming operation completion flag
      \arg        EFUSE_RDIC: clear read operation completion flag
      \arg        EFUSE_OBERIC: clear overstep boundary error flag
    \param[out] none
    \retval     none
*/
void efuse_flag_clear(uint32_t efuse_cflag)
{
    EFUSE_CS |= efuse_cflag;
}

/*!
    \brief      enable EFUSE interrupt
    \param[in]  source: specifies an interrupt to enable
                one or more parameters can be selected which are shown as below:
      \arg        EFUSE_INT_PG: programming operation completion interrupt
      \arg        EFUSE_INT_RD: read operation completion interrupt
      \arg        EFUSE_INT_OBER: overstep boundary error interrupt
    \param[out] none
    \retval     none
*/
void efuse_interrupt_enable(uint32_t source)
{
    EFUSE_CS = source;
}

/*!
    \brief      disable EFUSE interrupt
    \param[in]  source: specifies an interrupt to disable
                one or more parameters can be selected which are shown as below:
      \arg        EFUSE_INT_PG: programming operation completion interrupt
      \arg        EFUSE_INT_RD: read operation completion interrupt
      \arg        EFUSE_INT_OBER: overstep boundary error interrupt
    \param[out] none
    \retval     none
*/
void efuse_interrupt_disable(uint32_t source)
{
    EFUSE_CS &= ~source;
}

/*!
    \brief      get EFUSE interrupt flag is set or not
    \param[in]  efuse_flag: specifies to get a flag
                only one parameter can be selected which is shown as below:
      \arg        EFUSE_INT_PGIF: programming operation completion interrupt flag
      \arg        EFUSE_INT_RDIF: read operation completion interrupt flag
      \arg        EFUSE_INT_OBERIF: overstep boundary error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus efuse_interrupt_flag_get(uint32_t int_flag)
{
    if(EFUSE_CS & int_flag) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear EFUSE pending interrupt flag
    \param[in]  efuse_flag: specifies to clear a flag
                only one parameter can be selected which is shown as below:
      \arg        EFUSE_INT_PGIC: clear programming operation completion interrupt flag
      \arg        EFUSE_INT_RDIC: clear operation completion interrupt flag
      \arg        EFUSE_INT_OBERIC: clear overstep boundary error interrupt flag
    \param[out] none
    \retval     none
*/
void efuse_interrupt_flag_clear(uint32_t int_cflag)
{
    EFUSE_CS |= int_cflag;
}

/*!
    \brief      check whether EFUSE is ready or not
    \param[in]  efuse_flag: specifies to get a flag
                only one parameter can be selected which is shown as below:
      \arg        EFUSE_PGIF: programming operation completion flag
      \arg        EFUSE_RDIF: read operation completion flag
      \arg        EFUSE_OBERIF: overstep boundary error flag
    \param[in]  timeout: timeout value
    \param[out] none
    \retval     state of EFUSE
      \arg        EFUSE_READY: EFUSE operation has been completed
      \arg        EFUSE_BUSY: EFUSE operation is in progress
      \arg        EFUSE_OBER: overstep boundary error
      \arg        EFUSE_TOERR: EFUSE timeout error
*/
efuse_state_enum efuse_ready_wait(uint32_t efuse_flag, uint32_t timeout)
{
    efuse_state_enum efuse_state = EFUSE_BUSY;

    /* wait for EFUSE ready */
    do {
        /* get EFUSE flag set or not */
        if(EFUSE_CS & (uint32_t)efuse_flag) {
            efuse_state = EFUSE_READY;
        } else if(EFUSE_CS & EFUSE_CS_OVBERIF) {
            efuse_state = EFUSE_OBER;
        } else {

        }
        timeout--;
    } while((EFUSE_BUSY == efuse_state) && (0U != timeout));

    if(EFUSE_BUSY == efuse_state) {
        efuse_state = EFUSE_TOERR;
    }

    /* return the EFUSE state */
    return efuse_state;
}
